---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSetIterator.Reset
source: html/d0e971fa-2807-84ab-df18-19887749e86d.htm
---
# Autodesk.Revit.DB.Visual.AssetSetIterator.Reset Method

## Syntax (C#)
```csharp
public virtual void Reset()
```